Repository: neogeo-technologies/inspire_tester
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: Prototype built by Neogeo Technologies
fr: Prototype réalisé par Neogeo Technologies

source: Error
fr: Erreur

source: Service URL:
fr: URL du service :

source: Link to the management web application of this project
fr: Lien vers l'application de gestion du projet

source: WMS Service Identification
fr: Identification du service WMS

source: Service address to be tested:
fr: Adresse du service à tester :

source: Type the URL of the service you want to test
fr: Saisissez l'URL du service à tester

source: Use the cache
fr: Utiliser le cache

source: Check this box to use the Capabilities stored in the application database
fr: Cochez cette case pour utiliser les Capabilities stockées dans la base de données de l'application

source: Launch
fr: Exécuter

source: Last services:
fr: Derniers services :

source: Capabilities sum-up
fr: Résumé des Capabilities

source: Test results
fr: Résultat des tests

source: Raw Capabilities
fr: Capabilities brutes

source: Service Identification
fr: Identification du service

source: Service title:
fr: Nom du service :

source: Service abstract:
fr: Description du service :

source: Service URI:
fr: URL du service :

source: WMS version:
fr: Version de WMS :

source: Service keywords:
fr: Mots-clés du service :

source: Point of contact:
fr: Point de contact :

source: Point of contact position:
fr: Fonction du point de contact :

source: Point of contact address:
fr: Adresse du point de contact :

source: Capabilities of the service
fr: Résumé des Capabilities

source: GetCapabilities support:
fr: Les view services d'INSPIRE doivent implémenter l'opération GetCapabilities. Le service testé n'implémente pas cette opération.

source: GetCapabilities formats:
fr: Résumé des Capabilities

source: No
fr: Non

source: GetMap support:
fr: Support de GetMap :

source: GetMap formats:
fr: Formats supportés par GetMap :

source: GetFeatureInfo support:
fr: Support de GetFeatureInfo :

source: GetFeatureInfo formats:
fr: Formats supportés par GetFeatureInfo :

source: Layers published by the service
fr: Couches publiées par le service

source: Layers extent:
fr: Etendue géographique des couches :

source: South:
fr: Sud :

source: North:
fr: Nord :

source: West:
fr: Ouest :

source: East:
fr: Est :

source: Total number of layers:
fr: Nombre total de couches :

source: Number of layer levels:
fr: Nombre de niveaux des couches :

source: Number of layers of first level:
fr: Nombre de couches de 1er niveau :

source: Number of layers of second level:
fr: Nombre de couches de 2e niveau :

source: Number of layers of third level:
fr: Nombre de couches de 3e niveau :

source: Number of supported coordinate systems
fr: Nombre de systèmes de coordonnées supportés :

source: Languages
fr: Langues

source: Default language:
fr: Langue par défault :

source: Additional supported languages:
fr: Autres langues supportées :

source: Number of critical errors:
fr: Nombre d'erreurs critiques :

source: Number of non critical errors:
fr: Nombre d'erreurs non critiques :

source: Number of warnings:
fr: Nombre d'avertissements :

source: An %s HTTP error has been encountered
fr: Une erreur HTTP %s a été rencontrée en essayant d'accéder au service dont vous avez fourni l'URL. Veuillez vérifier l'URL du service ou réessayer ultérieurement

source: The provided URL doesn't seem to be correct. Please check your service URL.
fr: L'URL proposée ne semble pas correcte. Merci de vérifier l'URL de votre service.

source: The provided URL doesn't seem to match a WMS service. We can't proceed to any further test on this URL
fr: L'URL que vous avez fournie ne semble pas être celle d'un service WMS. Nous ne pouvons exécuter nos tests avec cette URL.

source: Found value(s): %(found)s - Expected value(s): %(expected)s
fr: Valeur(s) présente(s) : %(found)s - Valeur(s) attendue(s) : %(expected)s

source: <None>
fr: <Aucune>

source: Expected value(s): %(expected)s
fr: Valeur(s) attendue(s) : %(expected)s

source: Layers: %s
fr: Couches : %s

source: Unexpected value: %s
fr: Valeur inattendue : %s

source: msg_title_000 test scope and completeness
fr: Périmètre et complétude des tests réalisés

source: msg_desc_000 test scope and completeness
fr: Cette application vérifie que le contenu de la réponse aux requêtes GetCapabilities est correct au regard des exigences et recommandations applicables au profil WMS du document Technical Guidance for the implementation of INSPIRE View Services 3.0. Cette application n'a pas pour objectif de vérifier que le service est conforme aux spécifications WMS 1.3.0. Elle se focalise sur les spécificités d'INSPIRE. Les tests réalisés ne sont pas complets et évolueront avec les temps.

source: msg_title_001 WMS version
fr: Version de WMS

source: msg_desc_001 WMS version
fr: Les view services d'INSPIRE doivent implémenter la version 1.3.0 du standard WMS (ISO 19128). Le service testé implémente une autre version.

source: msg_title_002 GetCapabilities support
fr: Support de GetCapabilities

source: msg_desc_002 GetCapabilities support
fr: Les view services d'INSPIRE doivent implémenter l'opération GetCapabilities. Le service testé n'implémente pas cette opération.

source: msg_title_003 GetMap support
fr: Support de GetMap

source: msg_desc_003 GetMap support
fr: Les view services d'INSPIRE doivent implémenter l'opération GetMap. Le service testé n'implémente pas cette opération.

source: msg_title_004 HTTP GET binding GetCapabilities
fr: Support de HTTP GET pour GetCapabilities

source: msg_desc_004 HTTP GET binding GetCapabilities
fr: Il est recommandé que les view services d'INSPIRE supportent l'accès à l'opération GetCapabilities via des requêtes HTTP GET. Le service testé ne supporte pas ce mode de communication pour l'opération GetCapabilities.

source: msg_title_005 HTTP GET binding GetMap
fr: Support de HTTP GET pour GetMap

source: msg_desc_005 HTTP GET binding GetMap
fr: Il est recommandé que les view services d'INSPIRE supportent l'accès à l'opération GetMap via des requêtes HTTP GET. Le service testé ne supporte pas ce mode de communication pour l'opération GetMap.

source: msg_title_006 info scenario 1
fr: Scenario 1

source: msg_desc_006 info scenario 1
fr: Un élément <inspire_common:MetadataUrl> est présent dans l'élément <inspire_vs:ExtendedCapabilities> des Capabilities du service. La présence de cet élément permet de publier une partie des métadonnées du service en dehors des Capabilities du service (cf. scénario 1 des Technical Guidance des view services INSPIRE). La présente application ne vérifie pas que ces métadonnées externes sont correctement formées ni complètes.

source: msg_title_006.1 info scenario 2
fr: Scenario 2

source: msg_desc_006.1 info scenario 2
fr: L'élément <inspire_common:MetadataUrl> n'est pas présent dans l'élément <inspire_vs:ExtendedCapabilities> des Capabilities du service. L'absence de cet élément nécessite que l'ensemble des métadonnées du service soient publiées dans les Capabilities du service (cf. scénario 2 des Technical Guidance des view services INSPIRE).

source: msg_title_006.2 more than one inspire_common:MetadataUrl
fr: Plusieurs instances de <inspire_common:MetadataUrl>

source: msg_desc_006.2 more than one inspire_common:MetadataUrl
fr: Plus d'un élément <inspire_common:MetadataUrl> est présent dans l'élément <inspire_vs:ExtendedCapabilities> des Capabilities du service. Cet élément ne peut être présent qu'en un seul exemplaire à cet endroit.

source: msg_title_010.0 service title missing
fr: Service title - wms:Title

source: msg_desc_010.0 service title missing
fr: Le titre du service (Resource Title / wms:Title) est une information obligatoire pour les view services d'INSPIRE. Le service testé ne publie pas cette métadonnée.

source: msg_title_010.1 service abstract missing
fr: Service abstract - wms:Abstract

source: msg_desc_010.1 service abstract missing
fr: La description du service (Resource Abstract / wms:Abstract) est une information obligatoire pour les view services d'INSPIRE (contrairement à WMS 1.3.0 / ISO 19128). Le service testé ne publie pas cette métadonnée.

source: msg_title_010.2 inspire_vs:ExtendedCapabilities missing
fr: Capabilities étendues / inspire_vs:ExtendedCapabilities

source: msg_desc_010.2 inspire_vs:ExtendedCapabilities missing
fr: Les Capabilities du service doivent contenir un élément spécifique permettant de stocker des métadonnées additionnelles : inspire_vs:ExtendedCapabilities. Cet élément n'a pas été trouvé dans les Capabilities du service testé.

source: msg_title_011 inspire_common:ResourceType missing
fr: Resource type / inspire_common:ResourceType

source: msg_desc_011 inspire_common:ResourceType missing
fr: Dans le cadre du scénario 2 des view services d'INSPIRE, c'est-à-dire en l'absence de l'élément <inspire_common:MetadataUrl> dans l'élément <inspire_vs:ExtendedCapabilities>, un élément <inspire_common:ResourceType> doit obligatoirement être présent dans l'élément <inspire_vs:ExtendedCapabilities>. Cet élément n'a pas été trouvé dans les capabilities du service testé.

source: msg_title_011.1 invalid inspire_common:ResourceType value
fr: Resource type / inspire_common:ResourceType

source: msg_desc_011.1 invalid inspire_common:ResourceType value
fr: Le type de ressource (Resource Type) décrit par l'élément <inspire_common:ResourceType> présent dans l'élément <inspire_vs:ExtendedCapabilities> doit obligatoirement être renseignée avec la valeur 'service'. Le service testé utilise une autre valeur.

source: msg_title_015 inspire_common:SpatialDataServiceType missing
fr: Spatial data service type / inspire_common:SpatialDataServiceType

source: msg_desc_015 inspire_common:SpatialDataServiceType missing
fr: Dans le cadre du scénario 2 des view services d'INSPIRE, c'est-à-dire en l'absence de l'élément <inspire_common:MetadataUrl> dans l'élément <inspire_vs:ExtendedCapabilities>, un élément <inspire_common:SpatialDataServiceType> doit obligatoirement être présent dans l'élément <inspire_vs:ExtendedCapabilities>. Cet élément n'a pas été trouvé dans les capabilities du service testé.

source: msg_title_015.1 invalid inspire_common:SpatialDataServiceType value
fr: Spatial data service type / inspire_common:SpatialDataServiceType

source: msg_desc_015.1 invalid inspire_common:SpatialDataServiceType value
fr: Le type de ressource (Resource Type) décrit par l'élément <inspire_common:SpatialDataServiceType> présent dans l'élément <inspire_vs:ExtendedCapabilities> doit obligatoirement être renseignée avec la valeur 'view'. Le service testé utilise une autre valeur.

source: msg_title_016 infoMapAccessService keyword
fr: Mot-clef issu de la classification ISO des services de données spatiales

source: msg_desc_016 infoMapAccessService keyword
fr: Un mot-clef décrivant le type de service et issu du vocabulaire contrôlé 'ISO' doit être présent dans les mots-clefs du service. L'attribut 'vocabulary' de ce mot-clef doit avoir la valeur 'ISO'. Exemple : <wms:Keyword vocabulary="ISO">infoMapAccessService</wms:Keyword>. Aucun mot-clef de ce type n'a été trouvé.

source: msg_title_020 temporal reference subelement missing
fr: Référence temporelle

source: msg_desc_020 temporal reference subelement missing
fr: La référence temporelle associée au service doit contenir au moins un des éléments suivants : la date de création, la date de publication, la date de dernière révision et l'étendue temporelle. Aucun de ces éléments n'a été trouvé dans les capabilities du service.

source: msg_title_020.1 temporal reference - date of last revision
fr: Référence temporelle - date de dernière révision

source: msg_desc_0020.1 temporal reference - date of last revision
fr: La référence temporelle associée au service doit contenir de préférence la date de dernière révision. Cet élément n'a pas été trouvé dans les capabilities du service.

source: msg_title_021 temporal reference missing
fr: Référence temporelle absent

source: msg_desc_021 temporal reference missing
fr: Dans le cadre du scénario 2 des view services d'INSPIRE, c'est-à-dire en l'absence de l'élément <inspire_common:MetadataUrl> dans l'élément <inspire_vs:ExtendedCapabilities>, un élément <inspire_common:TemporalReference> doit obligatoirement être présent dans l'élément <inspire_vs:ExtendedCapabilities>. Cet élément n'a pas été trouvé dans les capabilities du service testé.

source: msg_title_022 conformity
fr: Conformité

source: msg_desc_022 conformity
fr: Dans le cadre du scénario 2 des view services d'INSPIRE, c'est-à-dire en l'absence de l'élément <inspire_common:MetadataUrl> dans l'élément <inspire_vs:ExtendedCapabilities>, un élément <inspire_common:Conformity> doit obligatoirement être présent dans l'élément <inspire_vs:ExtendedCapabilities>. Cet élément n'a pas été trouvé dans les capabilities du service testé.

source: msg_title_024 wms:Fees missing
fr: Conditions d'accès et d'utilisation

source: msg_desc_024 wms:Fees missing
fr: La présence de l'élément <wms:Fees> est obligatoire. Cet élément est absent des Capabilities du service testé.

source: msg_title_024.1 wms:Fees - no conditions apply - conditions unknown
fr: Conditions d'accès et d'utilisation - valeurs 'no conditions apply' et 'conditions unknown'

source: msg_desc_024.1 wms:Fees - no conditions apply - conditions unknown
fr: La valeur 'no conditions apply' pour l'élément <wms:Fees> doit être utilisée si aucune condition particulière ne s'applique à l'accès et à l'utilisation du service. La valeur 'conditions unknown' doit être utilisée si ces conditions sont inconnues.

source: msg_title_024.2 wms:Fees - none
fr: Conditions d'accès et d'utilisation - valeur 'none'

source: msg_desc_024.2 wms:Fees - none
fr: La valeur 'none' pour l'élément <wms:Fees> ne doit pas être utilisée si aucune condition particulière ne s'applique à l'accès et à l'utilisation du service ou si elles ne sont pas connues. La valeur 'no conditions apply' doit être utilisée si aucune condition particulière ne s'applique à l'accès et à l'utilisation du service. La valeur 'conditions unknown' doit être utilisée si ces conditions sont inconnues.

source: msg_title_024.3 wms:AccessConstraints missing
fr: Contraintes d'accès - <wms:AccessConstraints>

source: msg_desc_024.3 wms:AccessConstraints missing
fr: La présence de l'élément <wms:AccessConstraints> est obligatoire. Cet élément est absent des Capabilities du service testé.

source: msg_title_024.4 unexpected wms:AccessConstraints value
fr: Contraintes - <wms:AccessConstraints> - valeur inattendue

source: msg_desc_024.4 unexpected wms:AccessConstraints value
fr: Les valeurs conseillées pour l'élément <wms:AccessConstraints> sont 'None' et les valeurs de la liste de codes MD_RestrictionCode d'ISO 19115. La valeur présente dans les Capabilities du service testé ne fait pas partie de ces valeurs.

source: msg_title_0025.1 wms:ContactOrganization missing
fr: Absence de <wms:ContactOrganization>

source: msg_desc_0025.1 wms:ContactOrganization missing
fr: Le nom de l'organisme doit figurer dans l'élément <wms:ContactOrganization> de <wms:ContactPersonPrimary> des Capabilities du service. Soit cet élément n'a pas été trouvé dans les Capabilities du service testé soit il est vide.

source: msg_title_025.2 wms:ContactElectronicMailAddress missing
fr: Absence de <wms:ContactElectronicMailAddress>

source: msg_desc_025.2 wms:ContactElectronicMailAddress missing
fr: L'adresse de courier électronique du contact doit figurer dans l'élément <wms:ContactElectronicMailAddress> de <wms:ContactInformation> des Capabilities du service. Soit cet élément n'a pas été trouvé dans les Capabilities du service testé soit il est vide.

source: msg_title_026.1 wms:ContactPosition missing
fr: Absence de <wms:ContactPosition>

source: msg_desc_0026.1 wms:ContactPosition missing
fr: L'élément <wms:ContactPosition> de <wms:ContactInformation> doit obligatoirement être présent dans les Capabilities du service. Cet élément n'a pas été trouvé dans les Capabilities du service testé.

source: msg_title_026.2 invalid wms:ContactPosition value
fr: Valeur erronée de <wms:ContactPosition>

source: msg_desc_026.2 invalid wms:ContactPosition value
fr: La valeur de l'élément <wms:ContactPosition> de <wms:ContactInformation> n'est pas valide.

source: msg_title_027.1 inspire_common:MetadataPointOfContact - inspire_common:OrganisationName
fr: Nom de l'organisation du point de contact des métadonnées

source: msg_desc_027.1 inspire_common:MetadataPointOfContact - inspire_common:OrganisationName
fr: Dans le cadre du scénario 2 des view services d'INSPIRE, c'est-à-dire en l'absence de l'élément <inspire_common:MetadataUrl> dans l'élément <inspire_vs:ExtendedCapabilities>, le nom de l'organisme du point de contact des métadonnées doit figurer dans l'élément <inspire_common:OrganisationName> dans l'élément <inspire_common:MetadataPointOfContact>. Soit cet élément n'a pas été trouvé dans les capabilities du service testé, soit il est vide.

source: msg_title_027.2 inspire_common:MetadataPointOfContact - inspire_common:EmailAddress
fr: Adresse électronique du point de contact des métadonnées

source: msg_desc_027.2 inspire_common:MetadataPointOfContact - inspire_common:EmailAddress
fr: Dans le cadre du scénario 2 des view services d'INSPIRE, c'est-à-dire en l'absence de l'élément <inspire_common:MetadataUrl> dans l'élément <inspire_vs:ExtendedCapabilities>, l'adresse électronique du point de contact des métadonnées doit figurer dans l'élément <inspire_common:EmailAddress> dans l'élément <inspire_common:MetadataPointOfContact>. Soit cet élément n'a pas été trouvé dans les capabilities du service testé, soit il est vide.

source: msg_title_029.1 inspire_common:MetadataDate
fr: Date de création ou de mise à jour du service

source: msg_desc_029.1 inspire_common:MetadataDate
fr: Dans le cadre du scénario 2 des view services d'INSPIRE, c'est-à-dire en l'absence de l'élément <inspire_common:MetadataUrl> dans l'élément <inspire_vs:ExtendedCapabilities>, la date de création ou de dernière mise à jour du service doit être indiquée dans un élément inspire_common:MetadataDate> Soit cet élément n'a pas été trouvé dans les capabilities du service testé, soit il est vide.

source: msg_title_033.1 layer title - not the expected title for this layer name
fr: Titre de couche erroné.

source: msg_desc_033.1 layer title - not the expected title for this layer name
fr: Les titres des couches suivantes ne correspondent pas aux valeurs attendues pour ces couhes.

source: msg_title_033.2 layer title - not a harmonised title
fr: Titre de couche non harmonisé

source: msg_desc_033.2 layer title - not a harmonised title
fr: Le titre des couches suivantes ne sont pas des titres harmonisés.

source: msg_title_036 layer bbox CRS
fr: Omission de BoundingBox pour certains CRS

source: msg_desc_036 layer bbox CRS
fr: Certains CRS ne font pas l'objet d'un élément <BoundingBox>. Chaque couche doit contenir un élément <BoundingBox> pour l'ensembe des CRS qu'elle supporte.

source: msg_title_037 unique identifier
fr: Absence d'élément Identifier

source: msg_desc_037 unique identifier
fr: Chaque couche doit indiquer un identifiant unique associé à l'authorité identifiante.

source: msg_title_038 autority url
fr: Absente d'autorité identifiante

source: msg_desc_038 authority url
fr: Chaque couche doit contenir un élément <AuthorityURL> spécifiant le nom et l'URL de l'organisme à l'origine de la couche

source: msg_title_039.1 layer name - not a harmonised name
fr: Nom de couche non harmonisé

source: msg_desc_039.1 layer name - not a harmonised name
fr: Les noms des couches suivantes ne sont pas des noms harmonisés.

source: msg_title_040.1 recommended CRS
fr: CRS recommandés absents

source: msg_desc_040.1 recommended CRS
fr: Les systèmes de coordonnées recommandés (EPSG:4258, EPSG:4326, CRS:84) ne sont pas supportés par le service.

source: msg_title_042.1 default style missing
fr: Style par défaut absent

source: msg_desc_042.1 default style missing
fr: Le style par défaut 'inspire_common:DEFAULT' est absent pour les couches suivantes.

source: msg_title_047 LegendURL missing
fr: Absence d'élément LegendURL

source: msg_desc_047 LegendURL missing
fr: La présence de l'élément <wms:LegendURL> au sein de l'élément <Style> est obligatoire. Cet élément est absent des Capabilities du service testé.

source: msg_title_070.1 inspire_common:ResponseLanguage missing
fr: Langue de la réponse - inspire_common:ResponseLanguage

source: msg_desc_070.1 inspire_common:ResponseLanguage missing
fr: Les Capabilities du service doivent indiquer la langue utilisée pour leur rédaction. Cette langue doit être décrite dans un élément <inspire_common:ResponseLanguage>. Cet élément n'a pas été trouvé dans les Capabilities du service testé.

source: msg_title_070.2 more than one inspire_common:ResponseLanguage
fr: Langue de la réponse - inspire_common:ResponseLanguage

source: msg_desc_070.2 more than one inspire_common:ResponseLanguage
fr: L'élément <inspire_common:ResponseLanguage> ne doit être présent qu'une seule fois dans les Capabilities du service. Plus d'un de ces éléments ont été trouvés dans les Capabilities du service testé.

source: msg_title_070.3 inspire_common:ResponseLanguage not in inspire_common:SupportedLanguages
fr: Langue de la réponse - inspire_common:ResponseLanguage

source: msg_desc_070.3 inspire_common:ResponseLanguage not in inspire_common:SupportedLanguages
fr: La langue déclarée dans l'élément <inspire_common:ResponseLanguage> doit faire partie des langues supportées par le service (élément <inspire_common:SupportedLanguages>). La langue de la réponse ne fait pas partie des langues déclarées dans <inspire_common:SupportedLanguages>.

source: msg_title_071.1 inspire_common:SupportedLanguages missing
fr: Langues supportées - inspire_common:SupportedLanguages

source: msg_desc_071.1 inspire_common:SupportedLanguages missing
fr: L'élément <inspire_common:SupportedLanguages> doit obligatoirement être présent dans les Capabilities du service. Cet élément n'a pas été trouvé dans les Capabilities du service testé.

source: msg_title_071.2 more than one inspire_common:SupportedLanguages
fr: Langues supportées - inspire_common:SupportedLanguages

source: msg_desc_071.2 more than one inspire_common:SupportedLanguages
fr: L'élément <inspire_common:SupportedLanguages> doit être présent en un seul exemplaire dans les Capabilities du service. Cet élément a été trouvé plus d'une fois dans les Capabilities du service testé.

source: msg_title_071.3 inspire_common:DefaultLanguage missing
fr: Langue par défaut - <inspire_common:DefaultLanguage

source: msg_desc_071.3 inspire_common:DefaultLanguage missing
fr: Les Capabilities du service doivent indiquer la langue utilisée par défaut. Cette langue doit être décrite dans un élément <inspire_common:DefaultLanguage>. Cet élément n'a pas été trouvé dans les Capabilities du service testé.

source: msg_title_071.4 more than one inspire_common:DefaultLanguage
fr: Langue par défaut - <inspire_common:DefaultLanguage

source: msg_desc_071.4 more than one inspire_common:DefaultLanguage
fr: L'élément <inspire_common:DefaultLanguage> ne doit être présent qu'une seule fois dans les Capabilities du service. Plus d'un de ces éléments ont été trouvés dans les Capabilities du service testé.

source: msg_title_071.5 inspire_common:DefaultLanguage in inspire_common:SupportedLanguage
fr: Langues additionnelles supportées - inspire_common:SupportedLanguage>
