Repository: neogeo-technologies/inspire_tester
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: msg_desc_071.5 inspire_common:DefaultLanguage in inspire_common:SupportedLanguage
fr: La langue utilisée dans <inspire_common:SupportedLanguage> doit être différente de la langue par défaut (décrite dans l'élément <inspire_common:DefaultLanguage>). Une des langues additionnelles supportées décrites dans le service testé est la langue par défaut. Cette langue doit être retirée de la liste des langues additionnelles supportées.

source: msg_title_071.6 not a state member language
fr: Langues des états membres

source: msg_desc_071.6 not a state member language
fr: Une des langues décrites dans le Capabilities du service testé n'est pas une langue d'un des états membres.

source: msg_title_071.7 not a 3 letter language
fr: Langues - 3 lettres minuscules

source: msg_desc_071.7 not a 3 letter language
fr: Les codes des langues utilisés dans les Capabilities doivent contenir 3 lettres écrites en minuscules. Une des langues du Capabilities ne respecte pas cette règle.
